[
  {
    "thread_title": "'Play until we lose'",
    "summary_mt5": "'Play until we lose'.usually stop play win row sleep loss"
  },
  {
    "thread_title": "65% of Americans support monthly $2,000 COVID stimulus payments, new poll shows",
    "summary_mt5": "US voters support $2,000 Covid stimulus payments, new poll shows."
  },
  {
    "thread_title": "A comparison between the most graphically detailed eyes in gaming",
    "summary_mt5": "A selection of the most graphicly detailed eyes in gaming."
  },
  {
    "thread_title": "About the hatred for Holden Caulfield...",
    "summary_mt5": "Holden Caulfield is a teenager who has been accused of sexual abuse in schools. Here's what happened."
  },
  {
    "thread_title": "Adobe? Are you really playing f*king videos when I open PhotoShop?! OMFG.",
    "summary_mt5": "Adobe i d worth a lot of money?"
  },
  {
    "thread_title": "Am I the only one who isn’t bothered by this?",
    "summary_mt5": "If you’re a fan of Google, you might have noticed that it’s going to become an icon."
  },
  {
    "thread_title": "Amazon removes books promoting autism cures and vaccine misinformation",
    "summary_mt5": "Amazon removes books promoting autism cures and vaccine misinformation"
  },
  {
    "thread_title": "American English vs British English ",
    "summary_mt5": "British and American English speaking conventions based on the ground floor."
  },
  {
    "thread_title": "Americans considering filing for bankruptcy hits highest level since pandemic",
    "summary_mt5": "US officials considering filing for bankruptcy hit highest level since pandemic."
  },
  {
    "thread_title": "Author says Naval Academy canceled his lecture over removed book reference",
    "summary_mt5": "Author Jim Morrison says Naval Academy cancelled his lecture over removed book reference."
  },
  {
    "thread_title": "Bethesda has gifted every member of Skyblivion Team free keys for Oblivion Remastered, following its release earlier today.",
    "summary_mt5": "Bethesda has gifted every member of Skybnuon Team free keys for Oblivion Remastered, following its release earlier today."
  },
  {
    "thread_title": "Can someomne explain to me why the To in the frist sentence, please?",
    "summary_mt5": "Can someomne explain to me why the To in the frest sentence, please?"
  },
  {
    "thread_title": "Can we please boycott Star Wars battlefront 2",
    "summary_mt5": "Fans of Star Wars have been asked to boycott their latest video game."
  },
  {
    "thread_title": "Do average English natives know this word?",
    "summary_mt5": "Do average English natives know this word?"
  },
  {
    "thread_title": "Do border guards worldwide have a secret competition who puts more crooked stamps in most random passport pages?",
    "summary_mt5": "Do border guards worldwide have a secret competition who put more crooked stamps in most random passport pages?"
  },
  {
    "thread_title": "Do you still remember the hype back then when new Harry Potter books were released? Do you think we could experience this level of hype or something similar in the next 50 years?",
    "summary_mt5": "The hype over the release of new Harry Potter books has continued to rise."
  },
  {
    "thread_title": "Economist Warns That Elon Musk Is About to Cause a \"Deep, Deep Recession\"",
    "summary_mt5": "Economist warns that Elon Musk is about to cause a \"Deep, Deep Recession\"."
  },
  {
    "thread_title": "English is definitely a weird language.",
    "summary_mt5": "English is definitely a weird language."
  },
  {
    "thread_title": "Entire staff at federal agency that funds libraries and museums put on leave",
    "summary_mt5": "Federal agency that funds libraries and museums put on leave."
  },
  {
    "thread_title": "Fears of the economy tanking are now higher than they were at the height of the Covid pandemic",
    "summary_mt5": "Economists have been asked to comment on the economic impact of the coronavirus pandemic."
  },
  {
    "thread_title": "Fed report finds 75% of $800 billion Paycheck Protection Program didn't reach employees",
    "summary_mt5": "US Federal Reserve says 75% of $800 billion Paycheck Protection Program didn't reach employees."
  },
  {
    "thread_title": "Finished reading Name of the Rose",
    "summary_mt5": "This is a full transcript of 'The Rose' ."
  },
  {
    "thread_title": "First and Maybe Last Visit to India?",
    "summary_mt5": "The first and Maybe Last Visit to India?"
  },
  {
    "thread_title": "Foreign investors are dumping U.S. stocks at near-record pace",
    "summary_mt5": "Foreign investors are dumping US stocks at near-record pace."
  },
  {
    "thread_title": "Four days in Tirana, Albania in April 2025",
    "summary_mt5": "Each week we feature a selection of interesting photos from around the world."
  },
  {
    "thread_title": "Game console button layout",
    "summary_mt5": "Pokemon creators reveal their favourite players' layout for the next few days."
  },
  {
    "thread_title": "George R.R. Martin says 'The Winds of Winter' is 'the curse of my life'",
    "summary_mt5": "The BBC's weekly The Boss series profiles different writers from around the world. This week we speak to George R.R. Martin, author of 'The Winds of Winter'."
  },
  {
    "thread_title": "Help me with this question",
    "summary_mt5": "Here are some of the key phrases you need to know about future time."
  },
  {
    "thread_title": "Hi native speakers, would you say this is a difficult test?",
    "summary_mt5": "This is a difficult test for native speakers."
  },
  {
    "thread_title": "How Ironic.",
    "summary_mt5": "Each week we feature a selection of graphic design textbooks from across the world. Here are some of them."
  },
  {
    "thread_title": "How can I speak respectfully in English without using honorifics like 'Anh', 'Chị', or 'Chú'?",
    "summary_mt5": "How can I speak respectfully in English without using honorifics like 'Anh', ’Chị'?"
  },
  {
    "thread_title": "How do I retain my English level?",
    "summary_mt5": "How do I retain my English level?"
  },
  {
    "thread_title": "I cycled across Mongolia. Here are some pics. ",
    "summary_mt5": "I have been cycling across Mongolia for almost two decades."
  },
  {
    "thread_title": "I got off the horse by accident right before a cutscene in red dead",
    "summary_mt5": "funny scenes of a horse being taken off by accident."
  },
  {
    "thread_title": "I just bought red dead redemption, feeling excited!",
    "summary_mt5": "I just bought red dead redemption, feeling excited!"
  },
  {
    "thread_title": "I keep getting stopped at the US border and I just found it’s because of multiple “no shows”?",
    "summary_mt5": "I’ve been stopped at the US border for more than a decade."
  },
  {
    "thread_title": "I saw this logo today, I think it's a fantastic design",
    "summary_mt5": "Welcome to a new logo for the ave hear elf shelf."
  },
  {
    "thread_title": "I visited North Korea recently, these are some of the photos.",
    "summary_mt5": "North Korea's President Moon Jae-in has announced that he will visit the country next month."
  },
  {
    "thread_title": "In 2018 Jessica Johnson wrote an Orwell prize-winning short story about an algorithm that decides school grades according to social class. This year as a result of the pandemic her A-level English was downgraded by a similar algorithm and she was not accepted for English at St. Andrews University.",
    "summary_mt5": "A woman whose A-level English was downgraded by a similar algorithm has been criticised by the BBC."
  },
  {
    "thread_title": "Incarcerated Pennsylvanians now have to pay $150 to read. We should all be outraged.",
    "summary_mt5": "Incarcerated Pennsylvanians now have to pay $150 to read."
  },
  {
    "thread_title": "Is it just me or are airports weird?",
    "summary_mt5": "These are some of the things you need to know about airports."
  },
  {
    "thread_title": "Is this how you vertically alligning numbers?",
    "summary_mt5": "These are some of the tips you need to learn about how you alignment numbers?"
  },
  {
    "thread_title": "Is this the end?",
    "summary_mt5": "What do you do if you want to make YouTube clickbait thumbnail?"
  },
  {
    "thread_title": "Is this what it feels like to play a game for the first time again?(oblivion)",
    "summary_mt5": "Play a game for the first time again."
  },
  {
    "thread_title": "It ain't easy",
    "summary_mt5": "A few weeks ago a group of people asked us to use some of the most commonly used phrases in the US."
  },
  {
    "thread_title": "It's July 29, 2020, the day George R.R. Martin said we could imprison him if Winds Of Winter wasn't done",
    "summary_mt5": "Winds of Winter is the latest chapter in a series written by George R.R. Martin."
  },
  {
    "thread_title": "I’ve defeated the final boss of Elden ring 10,000 times as a summon! My characters name is LetMeSoloThem (let me solo her inspired me, but we are not the same person)",
    "summary_mt5": "I’ve defeated the final boss of Elden ring 10,000 times as a summon!"
  },
  {
    "thread_title": "Join the Battle for Net Neutrality!! We need to stop them from allowing ISPs to charge us extra fees to access ebooks, games or anything else!",
    "summary_mt5": "Welcome to the battle for net neutrality!"
  },
  {
    "thread_title": "Kids get a $2 discount if they read a book aloud to their barber while getting their haircut in Michigan",
    "summary_mt5": "Children who read aloud to their barber while getting haircut in Michigan are being offered $2 discounts."
  },
  {
    "thread_title": "Losing Income to AI",
    "summary_mt5": "Artificial intelligence (AI) is the latest technology to lose income in the UK."
  },
  {
    "thread_title": "Markets Are Discovering the Real Trump Trade Is ‘Sell America’",
    "summary_mt5": "Financial markets are discovering the real Trump trade is ‘sell America’, according to a new report.hi"
  },
  {
    "thread_title": "Maxing sneak in Oblivion the proper way",
    "summary_mt5": "Prison officers in England and Wales have been asked to submit their thoughts on how to reduce the risks of maxing sneak."
  },
  {
    "thread_title": "Minesweeper 99 x 99, 1500 mines. Took me about 2.5 hours to finish, nerve-wracking. No one might care, but just wanted to share this.",
    "summary_mt5": "This is a minesweeper."
  },
  {
    "thread_title": "My 5-minute redesign of Hillary's new logo. What do you think?",
    "summary_mt5": "Hillary Clinton's new logo has been released. Here are some of the things you need to know about it."
  },
  {
    "thread_title": "My parents (late 70s) got me a ps5 controller for Christmas. I do not own a playstation 5...",
    "summary_mt5": "My parents (late 70s) got me a ps5 controller for Christmas."
  },
  {
    "thread_title": "My parents missed (no showed) a connecting flight. What’s the best course of action?",
    "summary_mt5": "My parents missed a connecting flight. What’s the best course of action?"
  },
  {
    "thread_title": "My trip to Antarctica: icebergs, penguins, sleeping on the ice etc.",
    "summary_mt5": "My trip to Antarctica: icebergs, penguins and sleeping on the  Ice ..like pictures shared on Reddit.com."
  },
  {
    "thread_title": "My wife thinks video games are juvenile and playing them makes me less attractive.",
    "summary_mt5": "My wife thinks video games are juvenile and makes me less attractive."
  },
  {
    "thread_title": "National Geographic Cover",
    "summary_mt5": "National Geographic released images of plastic bag suppose look like ocean"
  },
  {
    "thread_title": "Not a single NPC has thanked me once.",
    "summary_mt5": "NPCs have thanked me for their laughs."
  },
  {
    "thread_title": "Novelist Katie Kitamura: ‘As Trump tries to take away everything I love, it’s never been clearer that writing matters’",
    "summary_mt5": "Writer Katie Kitamura explains why Trump tries to take away everything I love, it’s never been clearer that writing matters."
  },
  {
    "thread_title": "Oaxaca, Mexico — If there was ever a city in Mexico that embodies the spirit of magical realism this is it",
    "summary_mt5": "Oaxaca is a city in Mexico that embodies the spirit of magical realism this is it."
  },
  {
    "thread_title": "Passport was taken away when coming home from international flight?",
    "summary_mt5": "passport steal miss when coming home from international flight?"
  },
  {
    "thread_title": "Pope Francis reveals some secrets — and keeps many others — in new memoir",
    "summary_mt5": "Pope Francis's new memoir reveals some of his secrets."
  },
  {
    "thread_title": "President Trump Urging Congress to Pass Marijuana Banking Bill Before Midterms, Say Senate Staffers",
    "summary_mt5": "US President Donald Trump asked Congress to pass marijuana banking bill before midterm elections, say Senate Staffers."
  },
  {
    "thread_title": "Republicans Less Trusted on Economy Than Democrats For First Time in Years",
    "summary_mt5": "Republicans Less Trusted on Economy than Democrats For First Time in Years."
  },
  {
    "thread_title": "Roald Dahl's 'The Witches' is a fantastic depiction of a child with a short life expectancy",
    "summary_mt5": "Roald Dahl's 'The Witches' has been released on the British Library for the first time."
  },
  {
    "thread_title": "Some of my recent obsession with red/orange",
    "summary_mt5": "My recent obsession with red and orange.make obsessed"
  },
  {
    "thread_title": "Splurged on a hotel in Patagonia",
    "summary_mt5": "Patagonia's mountains have been named by a group of tourists. This is the latest images from the country."
  },
  {
    "thread_title": "Stephen King briefly talks about the controversial orgy scene in the 'IT' novel. 'It’s fascinating to me that there has been so much comment about that single sex scene and so little about the multiple child murders. That must mean something, but I’m not sure what.'",
    "summary_mt5": "Stephen King’s latest novel, 'It's the story of a single sex scene, has been published in London."
  },
  {
    "thread_title": "Take only what you need",
    "summary_mt5": "This is a selection of ideas you need to find out about the water crisis in Denver."
  },
  {
    "thread_title": "Take your time, you got this",
    "summary_mt5": "Take your time, you got this.think like game play minute tutorial"
  },
  {
    "thread_title": "Taken with a phone out of my hotel window in Venice... and no boats!",
    "summary_mt5": "Each week we feature a selection of images from around the world."
  },
  {
    "thread_title": "Taking a ride on the Bernina Express through the Alps",
    "summary_mt5": "The Bernina Express - the world's largest commuter train."
  },
  {
    "thread_title": "The Call of Duty moment that changed internet forever",
    "summary_mt5": "The Call of Duty moment that changed internet forever.closely follow"
  },
  {
    "thread_title": "The Dow plunges 1,000 points and the Nasdaq reels as Trump attacks Powell again",
    "summary_mt5": "US stock markets have fallen to their lowest level since the US Treasury chief Colin Powell was killed."
  },
  {
    "thread_title": "The Oblivion remaster character creator is just insane.",
    "summary_mt5": "The Oblivion remaster has been released. Here's a look at some of the latest characters created for the game."
  },
  {
    "thread_title": "The exact moment I took a step too close to the border between North and South Korea and got a push on the butt from two NK soldiers. What's your favorite travel photo of yourself?",
    "summary_mt5": "This is a selection of your favourite travel photos of yourself."
  },
  {
    "thread_title": "The new cover of TIME",
    "summary_mt5": "Time.need singing card thing play tetra theme"
  },
  {
    "thread_title": "The perfect cosplay doesn’t ex...",
    "summary_mt5": "The perfect cosplay doesn’t ex...."
  },
  {
    "thread_title": "This is how Facebook won Donald Trump the 2016 election.",
    "summary_mt5": "This is how Facebook won Donald Trump the 2016 election."
  },
  {
    "thread_title": "This is the stock market’s worst start to a presidential term in modern history",
    "summary_mt5": "The US stock market slumped to its worst start to a presidential term in modern history."
  },
  {
    "thread_title": "Tokyo under cherry blossoms, Mar/Apr 2025",
    "summary_mt5": "cherry blossoms have struck the streets of Tokyo in the past few days. Here's a selection of images from around the world."
  },
  {
    "thread_title": "Tourism to the US is declining at a rapid pace.",
    "summary_mt5": "tourism to the US is declining at a rapid pace."
  },
  {
    "thread_title": "Traded a few things for a Lenovo legion go today",
    "summary_mt5": "Lenovo legion traded a few things for someone go today."
  },
  {
    "thread_title": "Trudeau announces Canada ban on Russian oil imports. “Today, we are announcing a ban on all imports of crude oil from Russia, an industry that has benefited President Putin and his oligarchs greatly,”",
    "summary_mt5": "Canadian Prime Minister Justin Trudeau has announced a ban on all imports of crude oil from Russia."
  },
  {
    "thread_title": "Trump Admin disbands panels responsible for calculating GDP and collecting economic data",
    "summary_mt5": "US President Donald Trump's administration disbands panels responsible for calculating GDP and collecting economic data are being investigated by the FBI."
  },
  {
    "thread_title": "Trump Is About to Bet the Economy on a Theory That Makes No Sense",
    "summary_mt5": "US President Donald Trump says he is about to bet the economy on a theory that makes no sense."
  },
  {
    "thread_title": "Trump about to trigger greatest trade diversion ever seen",
    "summary_mt5": "US President Donald Trump says he wants to trigger greatest trade diversion ever seen."
  },
  {
    "thread_title": "Trump administration reportedly moves to ban Jackie Robinson biography from Naval Academy library",
    "summary_mt5": "US President Donald Trump says he wants to ban Jackie Robinson biography from Naval Academy library."
  },
  {
    "thread_title": "Trump slaps 104% tariff on China, effective midnight, confirms White House",
    "summary_mt5": "US President Donald Trump slaps 104% tariff on China, effective midnight, confirms White House."
  },
  {
    "thread_title": "Trump's first 50 days mark one of the worst starts for the S&P 500 under any presidency",
    "summary_mt5": "US President Donald Trump's first 50 days mark one of the worst starts for the S&P 500 under any presidency."
  },
  {
    "thread_title": "US Naval Academy library yanks Maya Angelou's memoir — and keeps 'Mein Kampf'",
    "summary_mt5": "'Mein Kampf' - a memoir written by Maya Angelou's former Nazi counterpart, tells the story of the Nazis."
  },
  {
    "thread_title": "US tourism to suffer huge '£49 billion drop' under Donald Trump",
    "summary_mt5": "US tourism to suffer huge '£49 billion drop' under Donald Trump."
  },
  {
    "thread_title": "Unpopular Opinion: I'd rather sit at home than an airport lounge",
    "summary_mt5": "In our series of letters from across the world, we look at some of the things you need to know about airport lounge."
  },
  {
    "thread_title": "We are not a company that needs a designer...",
    "summary_mt5": "Welcome to a new company that needs an designer....talk"
  },
  {
    "thread_title": "Well.....nobody is perfect :)",
    "summary_mt5": "funny gifs which appear to have been shared on social media"
  },
  {
    "thread_title": "What actually means draw in this context?",
    "summary_mt5": "These are some of the things you need to know about drawbridge."
  },
  {
    "thread_title": "What clients really want.",
    "summary_mt5": "What clients really want..want"
  },
  {
    "thread_title": "What does it mean?",
    "summary_mt5": "The asbestos pollution debate is being discussed in the UK."
  },
  {
    "thread_title": "What does this mean? ",
    "summary_mt5": "This is a full transcript of how students learn English language lessons."
  },
  {
    "thread_title": "Which one is better?",
    "summary_mt5": "What is the best way to delete account?"
  },
  {
    "thread_title": "Which one is it?",
    "summary_mt5": "What do you do if you want to use grammar wise?"
  },
  {
    "thread_title": "Who else wants Disney to bring back 2D animation?",
    "summary_mt5": "Disney wants to bring back 2D animation to the US."
  },
  {
    "thread_title": "Why can't I say nobody instead of no one?",
    "summary_mt5": "Why can't I say nobody instead of no one?"
  },
  {
    "thread_title": "Why do AI company logos look like buttholes?",
    "summary_mt5": "Why do AI company logos look like buttholes?"
  },
  {
    "thread_title": "Why do consumers hate it when brands try to connect with them?",
    "summary_mt5": "Why do consumers hate brands try to connect with them?"
  },
  {
    "thread_title": "Why is it singular?",
    "summary_mt5": "Why is it singular?"
  },
  {
    "thread_title": "Why is there a \"to\" in the last sentence? It sounds more natural to me without it",
    "summary_mt5": "Why is there a \"to\" in the last sentence?"
  },
  {
    "thread_title": "Why is there an apostrophe?",
    "summary_mt5": "Why is there an apostrophe?"
  },
  {
    "thread_title": "Why is this question considered ‘awful English’?",
    "summary_mt5": "Why is this question considered ‘awful English’?"
  },
  {
    "thread_title": "Wife and I hate big social events and love traveling. So rather than a normal wedding, traveled to Switzerland and did our vows in private. Photo from the day",
    "summary_mt5": "When I married my wife, I always wanted to get a wedding."
  },
  {
    "thread_title": "Woodstock Inn Brewery using AI on their beer cans",
    "summary_mt5": "Brewers using artificial intelligence on their beer cans"
  },
  {
    "thread_title": "boy gamer",
    "summary_mt5": "female gamers and their fellow players have been asked to comment on a video game."
  },
  {
    "thread_title": "how do people have the means to travel regularly",
    "summary_mt5": "Travel week year is one of the most important ways to spend a year abroad."
  },
  {
    "thread_title": "i went on a solo trip thinking i’d “find myself” or whatever… but instead i got drunk w a 73yo italian grandma & ended up in a village wedding??",
    "summary_mt5": "i went on a solo trip thinking I wanted to find myself."
  },
  {
    "thread_title": "what does ‘the fuck out of me’ mean?",
    "summary_mt5": "What does ‘the sex out of me’ mean?"
  },
  {
    "thread_title": "‘Reading Rainbow’ Host LeVar Burton Wants to Read to Families for Free, Neil Gaiman Offers Entire Catalog",
    "summary_mt5": "Neil Gaiman has released a new catalogue of children's book ‘Reading Rainbow’."
  },
  {
    "thread_title": "‘Shock to the system’: farmers hit by Trump’s tariffs and cuts say they need another bailout",
    "summary_mt5": "US President Donald Trump’s tariffs and cuts to commodity crops hit farmers say they need another bailout."
  },
  {
    "thread_title": "🍊",
    "summary_mt5": "(Be the full transcript of learn tropicana packaging redesign failure)"
  }
]